{"pageProps":{"post":{"year":"2004","month":"05","day":"06","slug":"esx-wave-organizer-version-0-1-released","filename":"2004-05-06-esx-wave-organizer-version-0-1-released.md","html":"<p>I decided to release it a little early to start getting some feedback. As of right now,\nthe \"Push Down\" and \"Push Up\" Buttons have no effect. Also, the \"Play\", \"Loop\", and \"Stop\"\nbuttons only work for .wav files that were dragged onto the workspace. You cannot preview\nfiles that came from a .esx file unless you \"extract\" it first, then drag the resulting .wav\nfile onto the workspace.</p>\n<p>Also, you cannot set the start, end, or loop start times. You cannot set the \"time slice\",\n\"auto sampling\", or \"playback level\" parameters. In the future, I hope to implement these\nfeatures. It depends on how much feedback I get, and how much spare time I have.</p>\n<p>There is also a minor bug in Version 0.1 that occurs when switching between the mono and stereo\nlists. If you click on a \"greyed\" selection, the \"focus\" of the main window will not change.<br>To test this, open \"ESX Wave Organizer\". Now click on Mono Sample 003. The \"focus\" of the main\nwindow is Mono Sample 003. Now click on Stereo Sample 005. The \"focus\" of the main window is\nStereo Sample 005. Now click on the \"greyed\" Mono Sample 003 again. The \"focus\" of the main\nwindow is still Stereo Sample 005. This is not a very big deal, just make sure you check the\n\"focus\" of the window when changing from mono to stereo, or refrain from clicking on the \"greyed\"\nselections.</p>\n","frontmatter":{"layout":"post","title":"ESX Wave Organizer - Version 0.1 Released","categories":["Electribe"],"tags":["Electribe","ESX-1","Korg","Projects","Update"],"type":"post","status":"publish"}},"previousTitle":"ES-1(step) - Version 1.0.0 Released","previousUrl":"/2003/09/es-1step-version-1-0-0-released","nextTitle":"ESX Wave Organizer - Version 0.1.1 Released","nextUrl":"/2004/05/esx-wave-organizer-version-0-1-1-released"},"__N_SSG":true}