{"pageProps":{"slug":"/projects/es1-step","filename":"_pages/projects/es1-step/index.md","html":"<h1 id=\"es-1step\">ES-1(step)</h1>\n<h2 id=\"info\">Info:</h2>\n<p>(ES-1)step is a program that allows you to hook up a midi keyboard to your computer,\nand send midi messages to your Korg ES-1 Electribe Sampler. Each midi key (up to 128)\ncontrols a 64 step pattern with all the ES-1 parameters. As long as you hold down that key,\nthe pattern will play on the ES-1. You can set any BPM (0-999), and hold down as many keys\nas you want. You can make your own presets, and also use the random generator, which will\nrandomly generate all the parameters for you (a random pattern, bpm, effects, etc.).</p>\n<h2 id=\"features\">Features:</h2>\n<ul>\n<li><p>Send midi messages to your ES-1 to create unique sounds for resampling and live playing</p>\n</li>\n<li><p>Use the random generator to configure your key settings</p>\n</li>\n<li><p>You can change Midi In and Midi Out devices at any time while running the program.</p>\n</li>\n<li><p>You can select different Channels for the midi in and out devices.</p>\n</li>\n<li><p>3 different pattern modes, you can select the starting and ending steps for a pattern</p>\n</li>\n<li><p>You can load and save presets. (all preset files are 578KB big)</p>\n</li>\n<li><p>You can select which of the 17 different parameters to send to the ES-1.</p>\n</li>\n<li><p>You can select which Note Numbers control the different parts on the ES-1.</p>\n</li>\n<li><p>New Random Generator Features -- You can give an upper and lower bound for 17 different\nparameters, and select which effects and parts are allowed to be assigned.</p>\n</li>\n<li><p>Key Settings Dialog -- You can now edit patterns and all their parameters on screen.</p>\n</li>\n<li><p>Set all function which allows you to set every step for every key to a specified value.</p>\n</li>\n<li><p>Panic button which automatically turns off all the keys when it is hit.</p>\n</li>\n<li><p>Updated GUI</p>\n</li>\n</ul>\n<h2 id=\"download\">Download:</h2>\n<p>Download: <a href=\"/downloads/ES1step.zip\">ES1step.zip (84kb)</a> [Last Updated September 3, 2003]</p>\n<h2 id=\"requirements\">Requirements:</h2>\n<ul>\n<li><p>A system running Microsoft Windows XP or earlier</p>\n</li>\n<li><p>A midi keyboard, or program that transmits MIDI messages</p>\n</li>\n<li><p>A Korg ES-1</p>\n</li>\n<li><p>Please see the note below about required DLLs</p>\n</li>\n</ul>\n<h2 id=\"installation\">Installation:</h2>\n<p>Just unzip the \"ES1step.zip\" file to a directory and run the file \"ES1step.exe\".</p>\n<p><strong>There are 5 files included in the .zip:</strong></p>\n<ul>\n<li>ES1step.exe</li>\n<li>Pitch Shift - Audio In.preset</li>\n<li>Pitch Shift - Part 1.preset</li>\n<li>pm_dll.dll</li>\n<li>README.txt</li>\n</ul>\n<p><em>NOTE: This program may require certain MFC (Microsoft Foundation Classes) DLLs that newer\nversions of Windows do not have included. If you recieve an error stating you are missing a\nDLL, please visit Microsoft.com to find out if your version of Windows supports the DLL you\nare missing (and download it).</em></p>\n<h2 id=\"disclaimer\">Disclaimer:</h2>\n<p>This program is distributed AS IS. I cannot assume responsibility for any loss or damage related\nto this application. It is not affiliated or supported by Korg in any way.</p>\n<h2 id=\"screenshots\">Screenshots:</h2>\n<p><strong>A screenshot of the main window:</strong></p>\n<p><img src=\"/images/es1step/es1step-main.jpg\" alt=\"A screenshot of the main window\"></p>\n<p><strong>A screenshot of the key settings window:</strong></p>\n<p><img src=\"/images/es1step/es1step-keys.jpg\" alt=\"A screenshot of the key settings window\"></p>\n<p><strong>A screenshot of the midi out dropdown menu:</strong></p>\n<p><img src=\"/images/es1step/es1step-mout.jpg\" alt=\"A screenshot of the midi out dropdown menu\"></p>\n<p><strong>A screenshot of the send these parameters dropdown menu:</strong></p>\n<p><img src=\"/images/es1step/es1step-send.jpg\" alt=\"A screenshot of the send these parameters dropdown menu\"></p>\n<p><strong>A screenshot of the random generator window:</strong></p>\n<p><img src=\"/images/es1step/es1step-rand.jpg\" alt=\"A screenshot of the random generator window\"></p>\n","frontmatter":{"layout":"page","title":"ES-1(step)"}},"__N_SSG":true}